ProgessBase/InformationRegisters/ПРГ_ПодписантыПоУмолчанию.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПРГ_ПодписантыПоУмолчанию</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПРГ_Подписанты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаТипДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МОЛ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СотрудникиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Отделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НСИ_Отделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ProgessBase/InformationRegisters/ПРГ_ПодписантыПоУмолчанию/Ext/ManagerModule.bsl
Функция ПолучитьДанные(Документ, Отделение = Неопределено, Роль = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ПРГ_ПодписантыПоУмолчаниюСрезПоследних.МОЛ КАК Сотрудник,
	|	ПРГ_ПодписантыПоУмолчаниюСрезПоследних.Должность
	|ИЗ
	|	РегистрСведений.ПРГ_ПодписантыПоУмолчанию.СрезПоследних КАК ПРГ_ПодписантыПоУмолчаниюСрезПоследних
	|ГДЕ
	|	&УсловиеДокумент
	|	И &УсловиеОтделение
	|	И &УсловиеРоль";
	
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеДокумент", "ТипДокумента = &ТипДокумента");
	Запрос.УстановитьПараметр("ТипДокумента", "Документ." + Документ.Метаданные().Имя);
	
	Если Отделение <> Неопределено Тогда
		Если ТипЗнч(Отделение) = Тип("Строка") Тогда
			Отделение = Справочники.НСИ_Отделения.НайтиПоНаименованию(Отделение);
		КонецЕсли;
		Если ТипЗнч(Отделение) = Тип("СправочникСсылка.НСИ_Отделения") Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеОтделение", "Отделение = &Отделение");
			Запрос.УстановитьПараметр("Отделение", Отделение);
		Иначе 
			ТекстЗапроса = "";
		КонецЕсли;
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеОтделение", "ИСТИНА");
	КонецЕсли;
	
	Если ТекстЗапроса <> "" И Роль <> Неопределено Тогда
		Если ТипЗнч(Роль) = Тип("Строка") Тогда
			Роль = Справочники.ПРГ_Подписанты.НайтиПоНаименованию(Роль);
		КонецЕсли;
		Если ТипЗнч(Роль) = Тип("СправочникСсылка.ПРГ_Подписанты") Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеРоль", "Подписант = &Роль");
			Запрос.УстановитьПараметр("Роль", Роль);
		Иначе 
			ТекстЗапроса = "";
		КонецЕсли;
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&УсловиеРоль", "ИСТИНА");
	КонецЕсли;
	
	Если ТекстЗапроса <> "" Тогда
		Запрос.Текст = ТекстЗапроса;
		Результат = Запрос.Выполнить().Выгрузить();
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
